# Задайте список. Напишите программу, которая определит, 
# присутствует ли в заданном списке строк некое число.-

# text = ['dawfgha', 'dwatbxe','dfgedaft', 'feada']
# search = 'da'

# for i in range(len(text)):
#     if search in text[i]:
#         print(f'Элемент c индексом {i} {search} найден')
# print('Такого элемента нет')

# Напишите программу, которая определит позицию второго
# вхождения строки в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

# text = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# search = "qwe"
# count = 0
# for i in range(len(text)):
#     if search == text[i]:
#         count += 1 
#         if count == 2:
#             print(i)
#             break
#     elif i == len(text) - 1:
#         print(-1)
